#coding:utf-8
import torch.nn as nn
import torch
from torch.autograd import Variable
class BidirectionalLSTM(nn.Module):

    def __init__(self, nIn, nHidden, nOut):
        super(BidirectionalLSTM, self).__init__()

        self.rnn = nn.LSTM(nIn, nHidden, bidirectional=True,batch_first=True)
        self.embedding = nn.Linear(nHidden * 2, nOut)

    def forward(self, input):
        recurrent, _ = self.rnn(input)
        b, T, h = recurrent.size()
        # print("333",recurrent.size())
        t_rec = recurrent.contiguous().view(T * b, h)

        output = self.embedding(t_rec)  # [T * b, nOut]
        output = output.view(b, T, -1)

        return output


class CRNN(nn.Module):

    def __init__(self, imgH, nc, nclass, nh, n_rnn=2, leakyRelu=False):
        super(CRNN, self).__init__()
        assert imgH % 16 == 0, 'imgH has to be a multiple of 16'

        ks = [3, 3, 3, 3, 3, 3, 2]
        ps = [1, 1, 1, 1, 1, 1, 0]
        ss = [1, 1, 1, 1, 1, 1, 1]
        nm = [64, 128, 256, 256, 512, 512, 512]

        cnn = nn.Sequential()

        def convRelu(i, batchNormalization=False):
            nIn = nc if i == 0 else nm[i - 1]
            nOut = nm[i]
            cnn.add_module('conv{0}'.format(i),
                           nn.Conv2d(nIn, nOut, ks[i], ss[i], ps[i]))
            if batchNormalization:
                cnn.add_module('batchnorm{0}'.format(i), nn.BatchNorm2d(nOut))
            if leakyRelu:
                cnn.add_module('relu{0}'.format(i),
                               nn.LeakyReLU(0.2, inplace=True))
            else:
                cnn.add_module('relu{0}'.format(i), nn.ReLU(True))
        #input 1×100×32
        convRelu(0)
        cnn.add_module('pooling{0}'.format(0), nn.MaxPool2d(2, 2))  # 64x50x16
        convRelu(1)
        cnn.add_module('pooling{0}'.format(1), nn.MaxPool2d(2, 2))  # 128x25x8
        convRelu(2, True)
        convRelu(3)
        cnn.add_module('pooling{0}'.format(2),
                       nn.MaxPool2d((2, 2), (2, 1), (0, 1)))  # 256x26x4
        convRelu(4, True)
        convRelu(5)
        cnn.add_module('pooling{0}'.format(3),
                       nn.MaxPool2d((2, 2), (2, 1), (0, 1)))  # 512x27x2
        convRelu(6, True)  # 512x26x1

        self.cnn = cnn
        self.rnn = nn.Sequential(
            BidirectionalLSTM(512, nh, nh),
            BidirectionalLSTM(nh, nh, nclass))

    def forward(self, input):
        # conv features
        # print("input",input.shape) #[64, 3, 32, 100]
        conv = self.cnn(input) #[batch,512,1,26]
        # print("crnn_conv",conv.shape)
        b, c, h, w = conv.size()
        assert h == 1, "the height of conv must be 1"
        conv = conv.squeeze(2) #[batch,512,26]
        # print("11",conv.shape)
        conv = conv.permute(0, 2, 1)  # [batch,26,512]
        # print("22",conv.shape)
        # rnn features
        output = self.rnn(conv) #[batch,26,nclass]

        return output

if __name__=="__main__":
    # label="玩钳貿杞塔丈搽豫漆蛮季循剖鸿姆螨锣哥茂炒旋揉绸则钓植積堅弓刨憨辆曹館曰盅去蹭臂靴宿鲨唱江芃芊么隆奉寨咚慢谦妩扎栈廊便攝夲夕末鹏满锋娶凖泣企助它方芪眸舞嗣湃病权挞阱狠款父慕箔拼吃綫飛論友旅莞钢镇晚拿煙搜陷志盆碱龙內逆鲩裹郑虑焗淑圆鲁润灵售喉准楞時輝卵标咿哩部栽啡靓舶羊锥腮哮寞酐察嚼頰瞌暮确得啰酮筐猎炭频危煎韵岸巍拳胶娴无杭衬娇寕雷層饶樟御糕麗炮弟剧蝇眞氣跌暇倡羙扫享璃压肘明尺烟觉從郵级游斑拽守玫存乃进码居交瞬咭商浸霖静肃佬偏浚品绒意扯铡穗缕梅枣裤锁黏製贮余种善懋猪侣盏林涛皺炽麺弥秘利暗滋炜酊葵李鎏镊袆盘院淇鑫鳥浒咏旭丸無洗触侵均畸叮疮任底趣笈袍霾吵悄域凿顔媄蓝蒸幅拐姨寧獭磷宙直削坐刮而連秀糜洒晔記柿讀厦锡净寢鋪真爵圣淮扶像烂铲履览眉久徒糝權苡侍由凡編髮愿神雪弯纠隋福謹濯漂資勃饵贡發痧绞陀装劲輔困紗离耐膀萃妝镶节曝悉歳刃穷诸微婭婕佳潮死诗亚邢涌了烨片蟆西圾雲首效湖務摇菇蛀候归潤枯挑勋痔缸晰壶箍研約藍洙透性抄极潍瘩人脸粵勤溅姬昌蛳唑鸥属臣氨蝶嬷荐狭鳍伞珊顽钮叱互邹裳运专鷄萝杆晶該帥涟忄缠邮太煊蚊夺列托姜案辰午沪瘤湿倪颜鐡什蝌璨門尹墨氢后崽塘蠶葆织主声浪盛厂屎順葫齿樓琦硫骄八升鐘呂闭環筋沱般翅换建扬珑介垫侬沾购犬漯荀平娟世于毯卉酚毛辣壞筏治急熥厘瑄潭蓄寡味骑心薄侨米蛲搁宋桶楽伐桧想整手绚庸剁型数筑恋参绕险葡輪窥喵办續哄煸醫灌昭蜕汞异芝旺蚁咯沽産肪翰漳臻峡颠敲掘痴戳豇略始醉痛砖烏我捕碎五乌缅虽锵兴礼扰号影卢阴鸣听器扭種縣裆疏北湘帶罪今燳闺呕惊蚌桥竞摸房毫厨次蜗覆铎稳貔斤池傅哦酸吨薬带龋恍锗忽核禮鹅噜兽靠姓画都茜偌空胎踏油也唇翻符窍莹姿低婆戰馈让儱俗例囊柳悠腺勇皱管霞陶碘凶铠潇给戒聘骆按蓬姚徐蒟髪露锳荆浮速钰啄力车艺湯叶州恩畜呼因投扣粽叫鹄骚耕共职溜苓护裙対哭漓祛猜呛怀角螂旧國濃斋宝递严卿上然賞強弱粤漸艳咱缘句帐经搐星崇棋暴模靡誠灶累俱價冤度晟慍魁抢易洁篇拯韩替闰測创賣粉差杯熙彼哆荔乏贰练俪湾試浣榉雙芸毅逗塗饅難绎衔轿婷妍術前擒浆貼寸凌盗忏纽坠彦倚概铬防抠时嗮疼依挥闽璇妻晳梦枞史灰全酷紀哪偕凉签嫩左珂磊校魏疯誓岗烁仰编緑取詢且瑜処许货赏催苗蒻裘基設麦摔浅岭翔涂狄陌鍵须玺叟冽粕梵徽巾溢佩扮蝴埋伟担嵌奥郭常贝劑减脖經播豹钽巡草题笼蒋磨铃曦爽現胖庚披误输膝阅骷修刷鸟涇嵩止缥绢氟陆遍炸丨嚴帮绍钟鋼乓喇拌補彤訂诺耻壊碁不天技娆综纪梧宠嗨滚悵谭寂鹿铰每封务颗气鉅離顿毡只阁邻粗呢谅栏绪填两休辦柱棕摄禧撃飾軽雑園膏刊韦狒国材眼凭信背簧雄沌盖博诠赞迷驴梢雌芭斛羡甄挫卸舆玮凛隐鹉富醋制近扒沙帚敌喫固猫將王剃既屌師犀士滩啥鍋業彻追頓陕法过工市晞损镍葱失様崎逸撼決曉緣展生退赛裱帛頭领扳冬骏驿撑海距莆马徹肤氏桁禅諾摩锶痘灸洞芍吧甫城凱枫圭宫歇療银媒遥简表蜡张猬皆熱鴨減寫告外芦体围鼎逹抓牵形棚鼙牌樣壳叛熨杀夹颓靑音分约邵灼消嬰節萬蔻惑啸少尤陇届锤订仓监毒硝瑰亭环维帯鸾网亮培溺孔幕尘拜春樂闻澈暂玄戏京玻枕祝判钙清视泵乘劣私绽横芙已哗逛欢授調行蚕倒裸蕾蛋及芒波伍辛胸岩楷苔脆挤橹尚聖蚪纲兩盼媛日彬裔欺添剩航报適走证遇唤查亲珍楊锅噢励闪丁笔一活捧没幚婊随鹭恤蟋琯以閃逊赣蕲岳渐恰瞅瓶野议优琳晕发恒道赌燥餠省棠耗夫间秤望点伺迪楠氛號登丫藏痣櫥铣芯童坚锐枸先路關荒含黛山包汁绷誌回焉冻脓停馴崔谧攻粮凄振或示熏步喔祺泊错胤菩涵河账柔项当侧情馏套滤择吸兼崖狱恶玛求扔營鄉茄脊电惯弛物和绗泷秩钒烙瑶哈奖迁刑璟征己些轮皇茯似猛骤缩璀團動瑞為苦遵责疾專何零尿必枰写董大智位苹从枭鹤卤屹弃瘊惠象彰阎臀珺藤涮宜檬娱緯阻睦伯戈辩烷鲷孙砸偶腰观血顏饱律斌亿磅类雾膛蹲卓初妇咀舜卷揭渗達篷笛您卜闸緖妳尽樊圈忍檐洲鉄砍冶云足訣槐公妮佐拢雁焰障衫训泸臺糠鬓系钞警騷怎鳕改澤跪终碑杉説徕着纺俺疗阶内厅毂夯歆渣哼识送赋瑚况拉滨藥颊卧醇瑙瀚帘驗钼銷供竖钨孕檀烤薪仇究巴汪凤孵琬中提故悬安胀录谢電護細并犸蔽泄纶丑椰悍窄豪字撒筠移镁罐诉拎偿媳罘弹撕畅嗪槍印盟豐啶火岚笑较颐括區愁痰正俊肥鏜萌肉來蕨稠肺傳寝咽蛇垃獸敛啃铆漩繁予箭返践井滴关孩庞爹霆輼刻炔幹吊蹄纹撇周劵乾四埃千両 質临堰桔府知霓薏宣拆资是敬馒翌籁厌蔬飼乎腐阔尸缇脂驶弦咳里蕊出跃占啖武逐立焦腱液具煖軍書杏崋秋鯽昱谋酬会陪艶镀百胡傲解健汇車祥寺儒旨蛎獅德财宪夢师军軒桂烊昨目琥兑感座污聲枪档昆奋川构蛤煌耦皖诞癫淀饼育烹紊石捉销塞努鸯飴薇組涯紹钛票虾箱丹土遗爪玲础裁脚槽到秧泼抱诵端額羞爱亡酱郎唢喱朔榄评金映铺身枚菜爲锂试顾涤放惟鄂摊柏僧呆脏组絶把尼仪探凯有郸砭招榴袖織谣控稿掉哚宗秒如纵虚怪檫混甬筒魔疝件突审残愉男舱旦鸡瀛悅决逢细岑舟肿旁奕折枝侈邯鎢完鵬苇磕献疆恐双賀拔别桨柒酥革灿窝醛借描孝铅精雕幽稍厚竭匀缝调动朴勁著掌叠歷禾澳贅焊伸傷拾晖碩終争醬璐铸妙燈但拟锦称红纬矣麻熬紧温袭蘑党还丛台佰腌晋硼鳯苍濠禹范几阵稻致巢杠長咧班柯嘧莉蔡鏡郁冕馆萄榻庭贴锈容鼓令黒燃民乒酪斗吗鹦谐玥抑體稚榜冰指寄垂荡罄亂辜翘撞珏褥强兒诚弘腕廉爷膨咨榛森根腾界搭榨嚣烫掸至隔穿凍非挚妥疲宏早溉啾苯舊刹需怡媚颖垛黎缓兹辈谨蕉滑历样能镰爾蛔洽傘乔罗俫泡势瓦漾索脱朱硬捌捏閩理膜漏盲绅住某芷芥甜昇尐免辞煞辧搅晨蜀僑敷貴颂丶齊绩赢渭岛琮烛式悔贯汤抵鞭晗咪绑澡棘申島刚芬證亵元浏菁僵缚菠下衣巧营文饪头鲸瓣风疤轧嫁壮巩密慎帅喷梯检麒射愣褲淄娃被蒂女鲶紅宽赐承梓谱載值独掟遂挠宸浑實龟烯韶嘴囤集税漱瞎妈洱飄瓷事藝叉閟逍预瑟穴激疵舍押馨際蜱潔钻咕鐵肾點小计笋畔扇十顆重肚凸獨引揚盾萨饭桉扑楂耀钦怕捆囡睿矿凝肢租坊疙教迫配淘开变食驰币绮虎愛该費挺卫面臭促懿赴彪读假割歓陳状鯉焕荞剑拒辅焖黯腿柠纱艇壁喂憬榔豆茶褐倍乐漫寇銀碳苪靜沁泛饥代裕东留拥搞罚息狼阜泳婴沏彭素逺驾涨扩炼歸気客绿觅块词断对帽涔茉软醒架葛糖援砧琢接来髅贺攀坡芜溶设伴蔓队仝蒙谷庆巣泽聆镭狂熊汉亏往菱作墙帆喽碧挂舰板裝矫過皓屉耍桌钉逻滇径関隙橱躺抖橋魄冠帜鞋腹地股財琅壬寳赤单贵沃卡讯羽副佛砂肖贤半众浇量坤町嬉威与炖倩功羔東脑麝扁晓笨熟腔摆选钣虐忘孟骗翎驭啦丢叻惹破将详哺矩泉骼桑请忌澎冒捶打矶认雨诱貅淋缔勾厢延炣越藻衆载罂浙另茗忆图酒籍充顯佑這仑层雜魂炎腊範鉴寻斐専远丘啪其盔苏船铝辟噬梨港悦起仁胚君菌统郝咤冲各救裂镌滿槛蠕汕挡释曬楚蔘嗑燙桩券楸很呦宾蓉丙逅澜实司比钧茵瞳牧灭执逝夏疣黃寒廿机標第青浊浴喧右饰普附爸袜蕴脐鸢曾姑剪再个名怒霉特珀昵摘勿澄盜料菀籽產乳缴屆泌原推址荧烧渍儿政吲吾焱帕酵函向凳糟迭齐更色迅聿费躲闲窖純署缺蒄照链哎版萎询杜赔渡二顺叭尊克话兄屑伊绳椒煮肩伦乱樹口蘇朋杂戴胺汶咖为贈弧飞習羚兆汝還報剔倾屁巅毁奇涧补暖虹戌妹躁凈豚運伽盒錶嗓鼻漢煲药顶缦胞忐划盈缤锌雍拓义切奔床驻撬秦术朵龍丰歪收朕增却蚂奴機熔翠科翟憋酶长岁轩鮮惫熠拍潜灣炉欧蔗氓靖腩迈橙沉邪萱布松褶翡谈田蛰馥誉济木侦英喝翁谊株陵湓积儥吉婚總滢召碍丽鲍钱囍冈绝铛化咒缎稔璋狮贱導洪养锰拷达吴脉蜂芳慈進鴻伙趋筝屏狐窗繹获賴鬼黄馅皙浩泥席拖數膠古張硒桃嘉骊肯率嘘访钊本勺鳞奏鹃碟擇命震盎瘦貳支肠违肴敦闯堂傻啤受虱期餅偉阿南册店买朦景瑾胜喜燕俩传極汀糯瞿睡胃眠厕銑縮橡華绨親螯計圳连广侠鸦仿额陽釀衍亩缈讲億使哑粧此服赶他截維抗窘战咬琼坨吕廣梭铜蟀殺寶恊峰噪貌蛊珞继痞灾俄據边柄纷鼠谁鸽际禪官竿勒挎汗泪劫贼肽之莊舖烦復薯员莱稀沖窃惧亜伏螺契孢纂猴唯抚唾宁琪妖養纯械瓮菊氮握芩呈墅嘟擎媽鳄害兵短腻碌针蠔败肝筆牢难球拱虫夜产酯猩碼応淳髙益攸瑕吐潘骐饿落干敢勝勐堆涡弗棉说邦莫旗葉棵磺琴朝襟霜续希殼祁仞纫态在苑否铭捞損挖遮你類蟹据栅夷匹搓忙蜜降亞央魚椎尔沂淨新析深三辽沟釉昕挪用言母蝎站柜疹姒仕膳椅撸康冀反待线纸胰惆束喘甩褪督宅針輕麯杰谓够晴吻辐炫沫骨娅楼巨捡栎途源爆就絮霏咆页薰的妆蕒絲勢網学村沥單義陈又痕老慧壹備購丝快艷痱冷犯找燊汛结泰鞘沐喬哇塑者踪踩艾年论貝贸皮兔禦跨剛欣寿铂绰习永负仲痒废啞員碰麓瓜淡醯兰榕鲜茨疑薦昊晾堡洛烽段塊伪筛仔罩邂耳份渠吖园沈尖晒玉赖魅龈区吹怖多睛舔联棒她唛粪万要娜看對鸭帝保姐坦驱湛侯芹庄盤户局級胧堵散鱸虞睁溪俏尾良梳仟貨雀秉所排婉九掺钜派患蘋兜华懂臨飮等玷诊程歲彩昡剂莓娘导鍾蚀哒斯婧說镜牡峦忧轻坏桐蚤飘呀迟汽贩场美場啊跳荟拨祖珠闷糊匠复傢坛脾刺典蓓廷販汐凹恼煜磐祸滔那伤闹悟斜窦键乡殊六白赚症策搏恢鬃纳县委答劳未槟芽融应幼遠储见曼萤启悲乖甘垢藿筷綱錄价硕宴室柚考歌尝香饲格迹碗凰持氯总荷粹紫酉串洋群屋社锻阙韬聚興浦捷缀菲嗖芋氧转莲粒验绘惜愈注逃成津豺烈相思爬赵圖幻韧仙箸庙識暑淤好皲蜘库嗽光语龄抛鹰廓轴唐采钩犹狗蹈粥显荣辫篮颁肌课孚莎昔翼迎奢甸蒲协膚睫風麥哟牛蛛施述纇铁梁曙们妞撻殁鲤超偷抹焼陰适喰娣呐付開抽入豌夾逼羅赠邀衡记演辨霸处瑪亨渴匙糙見寓医蘭七拭鲟跟热淼镂吓會紐烘缆操忑蟑置测袁懒备韓殖雅叔衰渔貂朗狸自水擦最壽做这赫馬团啫即栓嘿餐禁硅鱼玖呗染纤译優树果剥颈萧黑轨舌滕斧恭举花焙曲僮妃门若质牙伱避捂恨厉岂绻崬街辑搬沿鬚婦流鎖孜通芮默龚家橘粘呵问氙獻敏亦疫谜胆埠灯娥规萍舒阀聪廠绣奶携戊柑語簡琐奈盐嗔竹合辉念鸳造才箐欲茸倆钾限可靈饮磁蒜农舵間哨橄钥子樱序加渄觀甲除聊幸算題条雇境腋摈框柴挣創击章锯褂现锆书捍酿茧绵宇族哲棍刀批學月删聯卖枼杨冯仅袋沸棺臥泻刘泾络乙浓钠阳帖揽插同驼忠缨偽艦皂定跑峻高响业宛番藕隅"
    x=torch.randn(4,3,32,100)
    batch_size = x.size(0)
    crnn = CRNN(32, 3, 26, 256)
    # print(x.shape)
    output=crnn(x)
    print(output.shape) #[26,batch,nclass]

    # y=torch.randn(26,5)
    # y=y.transpose(1, 0).contiguous().view(-1)
    # preds_size = Variable(torch.IntTensor([output.size(0)] * batch_size))
    # print(y.shape)
